/*Реализуйте тело функции smallestDivisor(), используя итеративный процесс. Функция должна находить наименьший делитель заданного числа. Число, передаваемое в функцию, больше нуля.

Доп. условие: делитель должен быть больше единицы, за исключением случая, когда аргументом является единица (наименьшим делителем которой является также единица).

Например, наименьший делитель числа 15 это 3.
Идея алгоритма:

Попробуйте разделить число на 2.
Если число делится без остатка, то это наименьший делитель.
Если нет, то попробуйте следующий делитель.
Если ничего не делит число без остатка, то переданное число является простым, так что его наименьший делитель — оно само (не считая 1)*/

const smallestDivisor = (num) => {
  const iter = (div) => {
    if (div > num / 2) {
      return num;
    }
    if (num % div === 0) {
      return div;
    }
    return iter(div + 1);
  };
  return iter(2);
};

console.log(smallestDivisor(1));//1
console.log(smallestDivisor(2));//2
console.log(smallestDivisor(4));//2
console.log(smallestDivisor(7));//7
console.log(smallestDivisor(15));//3
