/* Напишите функцию smallestDivisor(). Она должна находить наименьший целый делитель числа. Поведение у функции такое же, как в предыдущем уроке, но реализация (код функции) должна быть другой. На этот раз реализуйте императивный итеративный процесс, что означает:

не используйте рекурсию
используйте переменные
используйте цикл while
Например, наименьший делитель числа 15 это 3.
Идея алгоритма:

Попробуйте разделить число на 2.
Если число делится без остатка, то это наименьший делитель.
Если нет, то попробуйте следующий делитель.
Если ничего не делит число без остатка, то переданное число является простым, так что его наименьший делитель — оно само (не считая 1) */

const smallestDivisor = (num) => {
  if (num <= 0) {
    return NaN;
  }

  if (num === 1) {
    return num;
  }

  let div = 2;
  while (num % div) {
    div = div + 1;
  }
  return div;
};


console.log(smallestDivisor(1));//1
console.log(smallestDivisor(3));//1
console.log(smallestDivisor(8));//8
